{
  "name": "Percival Latian",
  "hp":10,
  "maxHp":10,
  "tempHp":0,
  "class":[
    "artificer;2"
  ],
  "race":"dhampir",
  "stats":{
    "Strength":     7,
    "Dexterity":    16,
    "Constitution": 12,
    "Intelligence": 17,
    "Wisdom":       14,
    "Charisma":     3
  },
  "asi":{
    "str":0,
    "dex":0,
    "con":0,
    "int":0,
    "wis":0,
    "cha":0
  },
  "journal":{
    "entry 1":{
      "main":"a test entry",
      "subtitle": "Non quam ut sit eaque. Voluptas a consequatur et officia dolores accusamus quae corrupti. Hic ut quasi quidem beatae voluptas necessitatibus consequatur itaque quas. Fugiat nihil sit veritatis explicabo ea sit dicta.",
      "subtitle2": "another thing"
    }
  },
  "actions":{
    "Bite":{
      "type":"attack",
      "dice":["1d20+Constitution","1d4+0"],
      "description":"Your fanged bite is a natural weapon, which counts as a simple melee weapon with which you are proficient. You add your Constitution modifier, instead of your Strength modifier, to the attack and damage rolls when you attack with this bite. It deals 1d4 piercing damage on a hit. While you are missing half or more of your hit points, you have advantage on attack rolls you make with this bite. When you attack with this bite and hit a creature that isn’t a Construct or an Undead, you can empower yourself in one of the following ways of your choice:\n",
      "subactions":{
        "Heal": {
          "type":"heal;self",
          "heal":"damage",
          "description": "Your fanged bite is a natural weapon, which counts as a simple melee weapon with which you are proficient. You add your Constitution modifier, instead of your Strength modifier, to the attack and damage rolls when you attack with this bite. It deals 1d4 piercing damage on a hit. While you are missing half or more of your hit points, you have advantage on attack rolls you make with this bite."
        },
        "Bonus":{
          "type":"buff",
          "description": "You gain a bonus to the next ability check or attack roll you make; the bonus equals the piercing damage dealt by the bite.",
          "targets":["abilityChecks","attackRolls"]
        }
      }
    }
  },
  "features":{
    "Darkvision":"darkn-I HAVE DARKVISION",
    "Spider Climb":"creepy dhampir shit(tm)",
    "Vampiric Hunger":"Every dhampir knows a thirst slaked only by the living. This desire is a whisper in the mind, a tinge to the sight, a reflex constantly needing to be suppressed. Those who overindulge their thirst risk losing control and forever viewing others as prey. Those who resist might find exceptional ways of controlling their urges or suppress it through constant, molar-grinding restraint. In any case, temptation haunts dhampirs, and circumstances conspire to give them endless reasons to indulge.\nWhile many dhampirs thirst for blood, your character might otherwise gain sustenance from the living. Roll on or choose an option from the Dhampir Hungers table to determine what tempts your character to feed."
  },
  "inventory":[
    {
      "name":"dagger",
      "type":"weapon;finesse",
      "stats":{
        "toHit":1
      },
      "description":"stabby-stab"
    }
  ],
  "spellSlots":{
    "1":2,
    "2":0,
    "3":0,
    "4":0,
    "5":0,
    "6":0,
    "7":0,
    "8":0,
    "9":0
  },
  "spells":{
    "0":[
      {
        "name":"firebolt",
        "description":""
      }
    ],
    "1":[
      {
        "name":""
      }
    ],
    "2":[],
    "3":[],
    "4":[],
    "5":[],
    "6":[],
    "7":[],
    "8":[],
    "9":[]
  }
}